from src.utils import read_xls_file, set_dict
from data.config import XLS_PATH


def test_read_xls_file():
    list_with_transactions = read_xls_file(XLS_PATH)
    assert list_with_transactions[0] == {
        "Дата операции": "31.12.2021 16:44:00",
        "Дата платежа": "31.12.2021",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -160.89,
        "Валюта операции": "RUB",
        "Сумма платежа": -160.89,
        "Валюта платежа": "RUB",
        "Кэшбэк": 0.0,
        "Категория": "Супермаркеты",
        "МСС": 5411.0,
        "Описание": "Колхоз",
        "Бонусы (включая кэшбэк)": 3,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 160.89
    }


def test_set_dict():
    assert set_dict([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]) == {
        "Дата операции": 0,
        "Дата платежа": 0,
        "Номер карты": 0,
        "Статус": 0,
        "Сумма операции": 0,
        "Валюта операции": 0,
        "Сумма платежа": 0,
        "Валюта платежа": 0,
        "Кэшбэк": 0,
        "Категория": 0,
        "МСС": 0,
        "Описание": 0,
        "Бонусы (включая кэшбэк)": 0,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 0,
    }
